{
  "title": "Introducción a la probabilidad",
  "sections": [
    {
      "content": [
        {
          "type": "text",
          "value": "La probabilidad es una herramienta que permite describir la certidumbre de que ocurra un evento. Es frecuentemente utilizada para describir los resultados de experimentos aleatorios."
        }
      ]
    },
    {
      "content": [
        {
          "type": "text",
          "value": "Suponga que tenemos una moneda justa (sus caras son simétricas, no hay sesgo al lanzarse y las condiciones no favorecen ninguna cara). La moneda tiene dos caras: escudo y corona."
        },
        {
          "type": "text",
          "value": "Si la lanzamos sobre una mesa, ¿qué lado de la moneda tiene más probabilidades de mostrarse?"
        },
        {
          "type": "component",
          "name": "NarrativeQuestion",
          "props": {
            "options": [
              "Ambos son equivalentemente probables",
              "El escudo",
              "La corona"
            ]
          }
        }
      ]
    },
    {
        "content": [
        {
          "type": "text",
          "value": "Intuitivamente, sabemos que la probabilidad de que caiga escudo es la misma de que caiga corona, puesto que la moneda es justa"
        },
        {
          "type": "text",
          "value": "Cuando conocemos todos los resultados de un evento y estos son igualmente probables (es decir, no hay razones por las que creer que un resultado predomina sobre otro), podemos definir la probabilidad como un número entre 0 y 1 del siguiente modo:"
        },
        {
          "type": "component",
          "name": "Definition",
          "props":{
            "definition": "$$P(\\text{evento}) = \\frac{\\text{número de casos favorables}}{\\text{número de casos posibles}}$$"
          }
        }
        ]
    },
    {
        "content": [
            {
          "type": "text",
          "value": "Bajo esta definición, si queremos averiguar la probabilidad de que la moneda caiga en corona, podemos plantear que:"
        },
        {
          "type": "text",
          "value": "$$P(\\text{corona}) = \\frac{\\text{número de casos favorables}}{\\text{número de casos posibles}} = \\frac{1}{2}$$"
        },
        {
          "type": "text",
          "value": "Puesto que solo hay dos casos posibles (escudo o corona) y solo un caso favorable (corona), obtenemos que la probabilidad es de $0.5$, o bien $50\\%$."
        }
        ]
    },
    {
      "content": [
        {
          "type": "text",
          "value": "Podemos comprobar este resultado con otro experimento."
        },
        {
          "type": "text",
          "value": "Lanza la moneda varias veces y observa la distribución de los resultados obtenidos."
        },
        {
          "type": "component",
          "name": "CoinFlipSimulator",
          "props": {
            "fair": true
          }
        }
      ]
    },
    {
      "content": [
        { "type": "text", "value": "Según lo observado, ¿la moneda que estamos tirando es justa?"},
        {
          "type": "component",
          "name": "NarrativeQuestion",
          "props": {
            "options": ["Sí, la proporción de cabeza y escudo es muy similar", "No, un resultado aparece más frecuentemente"]
          }
        }
      ]
    },
    {
      "content": [
        {"type": "text", "value": "Si tiramos la moneda muchas veces, observamos que la proporción entre cabeza y escudo se aproxima mucho a un 50%. Esto indica que la moneda es justa."}
      ]
    },
    {
      "content": [
        {
          "type": "text",
          "value": "Cuando tenemos una moneda injusta o cargada, los resultados no van a ser igual de probables."
        },
        {
          "type": "text",
          "value": "Lanza esta moneda injusta varias veces y observa la distribución de los resultados obtenidos."
        },
        {
          "type": "component",
          "name": "CoinFlipSimulator",
          "props": {
            "fair": false
          }
        }
      ]
    },
    {
      "content": [
        {
          "type": "text",
          "value": "Cuando no sabemos si los casos posibles son igualmente probables, se suele utilizar una definición alternativa de la probabilidad:"
        },
        {
          "type": "text",
          "value": "$$P(\\text{evento}) \\approx \\frac{\\text{número de veces que ocurrió el evento}}{\\text{número total de repeticiones del experimento}}$$"
        },
        {
          "type": "text",
          "value": "Suponga que la moneda anterior se lanzó 40000 veces, de las cuales en 28000 salió escudo. ¿Cuál es la probabilidad aproximada de que obtengamos un escudo para la moneda anterior?"
        },
        {
          "type": "component",
          "name": "FreeResponse"
        }
      ]
    }
  ],
  "exercises": [
    {
      "content": [
        {
          "type": "text",
          "value": "¿Cuál es la probabilidad de que el dado caiga en 6?"
        },
        {
          "type": "component",
          "name": "FreeResponse"
        }
      ]
    },
    {
      "content": [
        {
          "type": "text",
          "value": "¿Cuál es la probabilidad de que el dado caiga ya sea en un 4 o en un 3?"
        },
        {
          "type": "component",
          "name": "FreeResponse"
        }
      ]
    },
    {
      "content": [
        {
          "type": "text",
          "value": "¿Cuál es la probabilidad de que el dado caiga en un 7?"
        },
        {
          "type": "component",
          "name": "FreeResponse"
        }
      ]
    }
  ]
}
